---
kind: other
id: Methods.T:Autodesk.Revit.UI.Events.SelectionChangedEventArgs
source: html/660e9a96-32b7-58d4-9b92-4b845eaea065.htm
---
# SelectionChangedEventArgs Methods

Returns the document associated with this event.